wisteria-1c/Конфигурация/Documents/ПоказателиЕНВД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоказателиЕНВД</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>999</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВсего1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВсего2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейВсего3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоказателиЕНВД</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельностиЕНВД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиЕНВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФизическогоПоказателя1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаДней1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФизическогоПоказателя2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаДней2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФизическогоПоказателя3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыработкаДней3</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

wisteria-1c/Конфигурация/Documents/ПоказателиЕНВД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом

	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Если ЗначениеЗаполнено(Параметры.Организация) Тогда
			Объект.Организация = Параметры.Организация;
		Иначе
			Объект.Организация = ПерсональныеНастройкиРУНФ.Прочитать("ОсновнаяОрганизация");
			Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
				Объект.Организация = Справочники.Организации.ПредопределеннаяОрганизация();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.СобытиеКалендаря) Тогда
		СобытиеКалендаря = Параметры.СобытиеКалендаря;
	КонецЕсли;
	
	Если Параметры.ОшибкиЗаполнения Тогда
		ПроверкаДанных.ВывестиСообщенияОбОшибкахЗаполнения("Объект", Параметры.ПереченьОшибок);
	КонецЕсли;
	
	ЗаполнитьСвязанныеССобытиеРеквизиты();
	НастроитьФорму();
	УстановитьВидимостьРабочихДней(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УказатьКоличествоРабочихДнейПриИзменении(Элемент)
	
	УстановитьВидимостьРабочихДней();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПоказателиЕНВД

&НаКлиенте
Процедура ПоказателиЕНВДВидДеятельностиЕНВДПриИзменении(Элемент)
	
	Если Элементы.ПоказателиЕНВД.ТекущиеДанные.ВидДеятельностиЕНВД.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	РабочиеДни = ПолучитьДанныеРабочихДней(
		Объект.Дата,
		Элементы.ПоказателиЕНВД.ТекущиеДанные.ВидДеятельностиЕНВД);
	
	Элементы.ПоказателиЕНВД.ТекущиеДанные.ВыработкаДней1 = РабочиеДни[0];
	Элементы.ПоказателиЕНВД.ТекущиеДанные.ВыработкаДней2 = РабочиеДни[1];
	Элементы.ПоказателиЕНВД.ТекущиеДанные.ВыработкаДней3 = РабочиеДни[2];
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗадатьРабочиеДни(Команда)
	УстановитьВидимостьРабочихДней();
КонецПроцедуры

&НаКлиенте
Процедура Перезаполнить(Команда)

	СписокОтвет = Новый СписокЗначений;
	СписокОтвет.Добавить(КодВозвратаДиалога.Да,НСтр("ru='Перезаполнить'"));
	СписокОтвет.Добавить(КодВозвратаДиалога.Отмена,НСтр("ru='Отмена'"));
	
	Если Объект.ПоказателиЕНВД.Количество() > 0 Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеОчистки", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru='Табличная часть будет очищена'"), СписокОтвет);
		Возврат;
	КонецЕсли;
	
	ПерезаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление1 = УсловноеОформление.Элементы.Добавить();

	ГруппаОтборов1 = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(
		УсловноеОформление1.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов1,
		"Объект.ПоказателиЕНВД.ЗначениеФизическогоПоказателя1", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов1, "Объект.ПоказателиЕНВД.ВыработкаДней1", 0,
		ВидСравненияКомпоновкиДанных.Больше);

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформление1, "ПоказателиЕНВДЗначениеФизическогоПоказателя1");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформление1, "ЦветТекста", ЦветаПалитры.Красный);

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформление1, "ПоказателиЕНВДЗначениеФизическогоПоказателя1");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформление1, "Текст", НСтр("ru='не задан'"));

	УсловноеОформление2 = УсловноеОформление.Элементы.Добавить();

	ГруппаОтборов2 = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(
		УсловноеОформление2.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов2,
		"Объект.ПоказателиЕНВД.ЗначениеФизическогоПоказателя2", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов2, "Объект.ПоказателиЕНВД.ВыработкаДней2", 0,
		ВидСравненияКомпоновкиДанных.Больше);

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформление2, "ПоказателиЕНВДЗначениеФизическогоПоказателя2");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформление2, "ЦветТекста", ЦветаПалитры.Красный);

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформление2, "ПоказателиЕНВДЗначениеФизическогоПоказателя2");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформление2, "Текст", НСтр("ru='не задан'"));

	УсловноеОформление3 = УсловноеОформление.Элементы.Добавить();

	ГруппаОтборов3 = РаботаСФормой.ДобавитьГруппуЭлементовОтбораКомпоновкиДанных(
		УсловноеОформление3.Отбор, ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);

	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов3,
		"Объект.ПоказателиЕНВД.ЗначениеФизическогоПоказателя2", 0, ВидСравненияКомпоновкиДанных.Равно);
	РаботаСФормой.ДобавитьЭлементОтбораКомпоновкиДанных(ГруппаОтборов3, "Объект.ПоказателиЕНВД.ВыработкаДней2", 0,
		ВидСравненияКомпоновкиДанных.Больше);

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформление3, "ПоказателиЕНВДЗначениеФизическогоПоказателя2");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформление2, "ЦветТекста", ЦветаПалитры.Красный);

	РаботаСФормой.ДобавитьОформляемыеПоля(УсловноеОформление3, "ПоказателиЕНВДЗначениеФизическогоПоказателя2");
	РаботаСФормой.ДобавитьЭлементУсловногоОформления(УсловноеОформление3, "Текст", НСтр("ru='не задан'"));
		
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОчистки(Ответ,Параметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязанныеССобытиеРеквизиты()
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ЗначениеЗаполнено(СобытиеКалендаря) Тогда
			ДатаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СобытиеКалендаря,
				"ДатаДокументаОбработкиСобытия");
		Иначе
			// предыдущий квартал
			ДатаДокумента = НачалоКвартала(ТекущаяДатаСеанса()) - 1;
		КонецЕсли;
		
		Док = РегламентированнаяОтчетностьЕНВД.ПолучитьДокументПоказателейЕНВД(Объект.Организация,ДатаДокумента);
	Иначе
		Док = Объект.Ссылка;
	КонецЕсли;
	
	ДокОбъект = Док.ПолучитьОбъект();
	Если ДокОбъект.ПоказателиЕНВД.Количество() = 0 Тогда
		ДокОбъект.ЗаполнитьДанныеДокумента();
		Модифицированность = Истина;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(ДокОбъект,"Объект");
	
	Заголовок = СтрШаблон("Показатели ЕНВД за %1 квартал %2",
		СтроковыеФункцииКлиентСервер.ПреобразоватьЧислоВРимскуюНотацию(Цел(Месяц(Объект.Дата) / 3), Ложь),
		Формат(Объект.Дата,"ДФ='yyyy ""г.""'"));
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	РеквизитОбъект.ЗаполнитьДанныеДокумента();
	РеквизитОбъект.Записать();
	ЗначениеВРеквизитФормы(РеквизитОбъект, "Объект");
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьФорму()
	
	Элементы.ПоказателиЕНВДЗаголовок1.Заголовок = 
		Формат(НачалоКвартала(Объект.Дата),"ДФ=MMMM") 
		+ " ("
		+ Объект.ДнейВсего1 
		+ " "
		+ ПодобратьСловоПодЧисло(Объект.ДнейВсего1, НСтр("ru='день'"),НСтр("ru='дня'"),НСтр("ru='дней'"))
		+ ")";
	
	Элементы.ПоказателиЕНВДЗаголовок2.Заголовок = 
		Формат(ДобавитьМесяц(НачалоКвартала(Объект.Дата),1),"ДФ=MMMM") 
		+ " ("
		+ Объект.ДнейВсего2 
		+ " "
		+ ПодобратьСловоПодЧисло(Объект.ДнейВсего2, НСтр("ru='день'"),НСтр("ru='дня'"),НСтр("ru='дней'"))
		+ ")";
	
	Элементы.ПоказателиЕНВДЗаголовок3.Заголовок = 
		Формат(КонецКвартала(Объект.Дата),"ДФ=MMMM") 
		+ " ("
		+ Объект.ДнейВсего3 
		+ " "
		+ ПодобратьСловоПодЧисло(Объект.ДнейВсего3, НСтр("ru='день'"),НСтр("ru='дня'"),НСтр("ru='дней'"))
		+ ")";
	
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ПоказателиЕНВДЗначениеФизическогоПоказателя1.Заголовок = 
			Элементы.ПоказателиЕНВДЗначениеФизическогоПоказателя1.Заголовок
			+ " ("
			+ Формат(НачалоКвартала(Объект.Дата),"ДФ=MMMM")+")";
		
		Элементы.ПоказателиЕНВДВыработкаДней1.Заголовок = 
			Элементы.ПоказателиЕНВДВыработкаДней1.Заголовок
			+ " ("
			+ Формат(НачалоКвартала(Объект.Дата),"ДФ=MMMM")+")";
			
		Элементы.ПоказателиЕНВДЗначениеФизическогоПоказателя2.Заголовок = 
			Элементы.ПоказателиЕНВДЗначениеФизическогоПоказателя2.Заголовок
			+ " ("
			+ Формат(ДобавитьМесяц(НачалоКвартала(Объект.Дата),1),"ДФ=MMMM")+")";
			
		Элементы.ПоказателиЕНВДВыработкаДней2.Заголовок = 
			Элементы.ПоказателиЕНВДВыработкаДней2.Заголовок
			+ " ("
			+ Формат(ДобавитьМесяц(НачалоКвартала(Объект.Дата),1),"ДФ=MMMM")+")";
			
		Элементы.ПоказателиЕНВДЗначениеФизическогоПоказателя3.Заголовок = 
			Элементы.ПоказателиЕНВДЗначениеФизическогоПоказателя3.Заголовок
			+ " ("
			+ Формат(КонецКвартала(Объект.Дата),"ДФ=MMMM")+")";
			
		Элементы.ПоказателиЕНВДВыработкаДней3.Заголовок = 
			Элементы.ПоказателиЕНВДВыработкаДней3.Заголовок
			+ " ("
			+ Формат(КонецКвартала(Объект.Дата),"ДФ=MMMM")+")";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьРабочихДней(СохранитьДанные = Истина)
	
	Если СохранитьДанные Тогда
		ХранилищеОбщихНастроек.Сохранить("ПоказателиЕНВД", "НастройкаДней", КоличествоРабочихДнейЗаданоВручную);
	Иначе
		Если ХранилищеОбщихНастроек.Загрузить("ПоказателиЕНВД", "НастройкаДней") = Истина Тогда
			КоличествоРабочихДнейЗаданоВручную = Истина;
		Иначе
			КоличествоРабочихДнейЗаданоВручную = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПоказателиЕНВДВыработкаДней1.Видимость = КоличествоРабочихДнейЗаданоВручную;
	Элементы.ПоказателиЕНВДВыработкаДней2.Видимость = КоличествоРабочихДнейЗаданоВручную;
	Элементы.ПоказателиЕНВДВыработкаДней3.Видимость = КоличествоРабочихДнейЗаданоВручную;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеРабочихДней(Дата, ВидДеятельности)
	
	МассивРезультат = Новый Массив(3);
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДеятельности, "ДатаНачала, ДатаОкончания, Актуально");
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ДатаНачала) Тогда
		Реквизиты.ДатаНачала = НачалоКвартала(Дата);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Реквизиты.ДатаОкончания) ИЛИ 
		Реквизиты.Актуально Тогда
		
		Реквизиты.ДатаОкончания = КонецКвартала(Дата);
	КонецЕсли;
	
	НачДата = НачалоДня(Макс(НачалоКвартала(Дата),Реквизиты.ДатаНачала));
	КонДата = НачалоДня(Мин(КонецМесяца(НачалоКвартала(Дата)), Реквизиты.ДатаОкончания));
	Дней = (КонДата-НачДата)/(24*60*60);
	МассивРезультат[0] = ?(Дней>=0,Дней+1,0);
	
	НачДата = НачалоДня(Макс(ДобавитьМесяц(НачалоКвартала(Дата),1),Реквизиты.ДатаНачала));
	КонДата = НачалоДня(Мин(КонецМесяца(ДобавитьМесяц(НачалоКвартала(Дата),1)), Реквизиты.ДатаОкончания));
	Дней = (КонДата-НачДата)/(24*60*60);
	МассивРезультат[1] = ?(Дней>=0,Дней+1,0);
	
	НачДата = НачалоДня(Макс(ДобавитьМесяц(НачалоКвартала(Дата),2),Реквизиты.ДатаНачала));
	КонДата = НачалоДня(Мин(КонецМесяца(ДобавитьМесяц(НачалоКвартала(Дата),2)), Реквизиты.ДатаОкончания));
	Дней = (КонДата-НачДата)/(24*60*60);
	МассивРезультат[2] = ?(Дней>=0,Дней+1,0);
	
	Возврат МассивРезультат;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПодобратьСловоПодЧисло(Число, СловоДляОдин, СловоДляДва, СловоДляПять)
	
	Если Число > 4 И Число < 21 Тогда
		
		Возврат СловоДляПять;
		
	ИначеЕсли (Число % 10) = 1 Тогда
		
		Возврат СловоДляОдин;
		
	ИначеЕсли (Число % 10) <= 5 Тогда
		
		Возврат СловоДляДва;
		
	Иначе
		
		Возврат СловоДляПять;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
